[
    {
        "id": 1001,
        "title": "Registration & morning Coffee",
        "description": "Get your badge, coffee, enjoy talking with tech edicts around",
        "language": "",
        "complexity": "",
        "presentation": "",
        "video": ""
    },
    {
        "id": 1002,
        "title": "GDG DevFest London 2015 Opening",
        "description": "Official start of the conference. Greetings from the organizers, sponsors and partners.",
        "language": "en",
        "complexity": "",
        "presentation": "",
        "video": ""
    },
    {
        "id": 1003,
        "title": "Lunch",
        "description": "Foooooooood!",
        "language": "",
        "complexity": "",
        "presentation": "",
        "video": ""
    },
    {
        "id": 1004,
        "title": "Coffee break",
        "description": "Coffeeeeeee!",
        "language": "",
        "complexity": "",
        "presentation": "",
        "video": ""
    },
    {
        "id": 1005,
        "title": "Wrap Up",
        "description": "",
        "language": "",
        "complexity": "",
        "presentation": "",
        "video": ""
    },
    {
        "id": 1,
        "title": "fans.start() - Saving on heating bills with WebGL",
        "description": "A trip through real-time graphics programming using WebGL through in-depth technical breakdowns of various demos, featuring massive particle systems, volumetric rendering, fluid dynamics simulations, and more.",
        "speakers": [
            1
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Web",
            "WebGL"
        ]
    },
    {
        "id": 2,
        "title": "Asynchronous Data Streams in Angular 2",
        "description": "Angular 2 introduces a new Data Architecture based on Reactive Programming. We are really excited to see the new approach using Observable sequences aka Observables. Besides, the new HTTP module was released only a month ago! We will cover a basic introduction of Angular 2 followed by streams and the new HTTP API covering some basic use cases.",
        "speakers": [
            2
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Web",
            "AngularJS"
        ]
    },
    {
        "id": 3,
        "title": "Why Google Cloud Platform is the cloud for you",
        "description": "Google Cloud Platform is a world class platform for running all sorts of applications. In this session learn about the philosophy behind Google Cloud Platform and why it is 'the' platform for running your application. Google is a company that has been delivering internet scale solutions like search, Gmail etc for years and are always looking at ways to make developers more productive. This Session will explain how by using Google Cloud Platform  you can become as productive as Google developers.",
        "speakers": [
            3
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Cloud"
        ]
    },
    {
        "id": 4,
        "title": "Give your users superpowers in the real world",
        "description": "People no longer need to sit at a desk to get the benefits of technology. You can now build experiences that work seamlessly between the digital world and the real world. Superpowers that would not have been possible, too complex or prohibitively expensive are now possible. Join this session for the latest update from Google on the platform components now available.",
        "speakers": [
            4
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Wearables",
            "IoT",
            "Android"
        ]
    },
    {
        "id": 5,
        "title": "Hooked on HTTP/2: Building services with gRPC",
        "description": "gRPC is a language-neutral, platform-neutral RPC framework and toolset which is based on the finalized HTTP/2 standard and developed and open sourced by Google. It can be used to build highly performant, scalable APIs by allowing developers to define services using a powerful binary serialization toolset and language called Protocol Buffers. It can also be used to generate idiomatic client and server stubs from service definitions written in a variety of languages. In this session you’ll learn all about gRPC and how it benefits from being based on HTTP/2 and through the use of a working demo and detailed code examples you’ll learn how to build gRPC enabled microservices and clients.",
        "speakers": [
            5
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Cloud",
            "gRPC"
        ]
    },
    {
        "id": 6,
        "title": "Progressive Web Apps and Push Notifications",
        "description": "There have historically been significant differences between native apps and the Mobile Web in regards to performance, capabilities and user expectations. On Android, Web apps live in the browser, while native apps are everywhere. In this session you will learn about Progressive Web Apps, Push Notifications and other recent changes in Chrome that enable you to deliver rich and integrated experiences that delight your users.",
        "speakers": [
            6
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Web",
            "Android",
            "Webapps"
        ]
    },
    {
        "id": 7,
        "title": "Media for the next billion users",
        "description": "Learn about the powerful new media APIs and platforms that enable delivery of audio and video to a variety of devices and usage contexts. Find out to how cope with flakey connectivity and variable bandwidth, how to record video and interact with input and output devices via JavaScript  — and learn about the future of codec engineering and the media industry.",
        "speakers": [
            7
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Web"
        ]
    },
    {
        "id": 8,
        "title": "What’s my car thinking? - A different type of mobile computing",
        "description": "We have all heard in the news of the rise of car manufacturers lying to drivers about their car's performance, but what happens if you own an old car? Do you even have or use a car in London? If not then you might not care.  Anyway, come and find out how I used an Android phone, an embedded bluetooth sensor, Google Maps and a whole load of Google Cloud Services to figure out what was happening under the hood.  Plus, for an extra bonus, we will go into detail of some the Easter Eggs and features that now available in Google Maps App as well as some other fun things you might not know about Google Maps.  You'll never look at a Google map the same way again! ",
        "speakers": [
            8
        ],
        "presentation": "",
        "video": "",
        "tags": [
            "Cloud",
            "Android",
            "Maps"
        ]
    }
]
